var a = [
  [
    "صنایع خودرو"
    ,2              
  ],
  [
    "الکترونیک"
    ,2         
  ],
  [
    "صنایع چوب"
    ,2              
  ],
  [
    "صنایع کاغذ"
    ,2             
  ],
  [
    "جوشکاری و بازرسی جوش"
    ,2     
  ],
  [
    "حمل ونقل زمینی"
    ,2           
  ],
  [
    "حمل ونقل دریایی"
    ,2       
  ],
  [
    "حمل و نقل ریلی"
    ,2            
  ],
  [
    "تاسیسات"
    ,2           
  ],
  [
    "صنایع دریایی"
    ,2         
  ],
  [
    "صنایع رنگ"
    ,2            
  ],
  [
    "صنایع شیمیایی"
    ,2     
  ],
  [
    "پلیمر"
    ,2            
  ],
  [
    "پتروشیمی"
    ,2         
  ],
  [
    "صنایع چرم وپوست و خز"
    ,2     
  ],
  [
    "صنایع نساجی"
    ,2         
  ],
  [
    "متالورژی"
    ,2            
  ],
  [
    "فناوری ارتباطات"
    ,2         
  ],
  [
    "مدیریت  صنایع"
    ,2           
  ],
  [
    "سرامیک"
    ,2           
  ],
  [
    "مکانیک"
    ,2            
  ],
  [
    "کنترل وابزار دقیق"
    ,2       
  ],
  [
    "برق"
    ,2              
  ],
  [
    "صنایع فلزی"
    ,2         
  ],
  [
    "ساختمان"
    ,2           
  ],
  [
    "معماری"
    ,2        
  ],
  [
    "صنعت چاپ"
    ,3      
  ],
  [
    "معدن"
    ,2        
  ],
  [
    "امور اداری"
    ,1      
  ],
  [
    "امور مالی و بازرگانی"
    ,1         
  ],
  [
    "بهداشت و ایمنی"
    ,1           
  ],
  [
    "فناوری اطلاعات"
    ,1          
  ],
  [
    "مراقبت و زیبایی"
    ,1          
  ],
  [
    "خدمات آموزشی"
    ,1          
  ],
  [
    "صنایع پوشاک"
    ,1         
  ],
  [
    "گردشگری"
    ,1         
  ],
  [
    "هتلداری"
    ,1         
  ],
  [
    "امورشیلات و آبزی پروری"
    ,4         
  ],
  [
    "امور دام و ماکیان"
    ,4        
  ],
  [
    "امور باغی"
    ,4          
  ],
  [
    "امور زراعی"
    ,4          
  ],
  [
    "زیست فناوری"
    ,4        
  ],
  [
    "فناوري محیط زیست"
    ,4      
  ],
  [
    "ماشین آلات کشاورزی"
    ,4       
  ],
  [
    "صنایع غذایی"
    ,4          
  ],
  [
    "خدمات تغذیه ای"
    ,1        
  ],
  [
    "فرش"
    ,3         
  ],
  [
    "صنایع دستی (چوب، فلز، سفال، چاپ، سنگ ،شیشه ، چرم)"
    ,3   
  ],
  [
    "صنایع دستی (دوخت های سنتی)"
    ,3         
  ],
  [
    "طلا و جواهرسازی"
    ,3           
  ],
  [
    "هنرهای تجسمی"
    ,3         
  ],
  [
    "هنرهای تزئینی"
    ,3        
  ],
  [
    "هنرهای نمایشی"
    ,3      
  ],
  [
    "صنایع دستی(بافت)"
    ,3      
  ],
  [
    "فناوری نرم وفرهنگی"
    ,3      
  ],
  [
    "صنعت ورزش"
    ,3          
  ],
  [
    "فناوری هوایی"
    ,2       
  ],
  [
    "فناوری نانو"
    ,2      
  ],
  [
    "گياهان دارويي و داروهای گیاهی"
    ,4    
  ],
  [
    "سلامت و طب ایرانی"
    ,1        
  ],
  [
    "فناوري انرژي های نو و تجدید پذیر"
    ,2      
  ],
  [
    "مدیریت آب"
    ,2        
  ],
  [
    "منابع طبیعی (جنگل، مرتع ،آبخیز و بیابان)"
    ,4        
  ],
  [
    "صنایع بسته بندی"
    ,2       
  ],
  [
    "خدمات حقوقی"
    ,1     
  ],
  [
    "صنعت گاز"
    ,2        
  ],
];


a.sort((b,c) => b[1] - c[1])

a.map((item,index) => {
  console.log(`${index} : ${item[0]} --> ${item[1]}`);
})